tylertms/dspic33e-sim/tests/architecture/dspic33/api_test.c
#include <stdint.h>

#include "dspic33.h"
#include "test.h"

typedef struct {
    uint32_t address;
    uint32_t opcode;
    uint32_t count;
} TraceCapture;

enum {
    OPCODE_POWER_SAVE_SLEEP = 0xfe4000u,
    OPCODE_POWER_SAVE_IDLE = 0xfe4001u,
    OPCODE_NOP = 0x000000u,
    TIMER1_VECTOR = 0x001au,
    UART1_RECEIVE_VECTOR = 0x002au,
    INTERRUPT_ENABLE_0 = 0x0820u,
    INTERRUPT_PRIORITY_0 = 0x0840u,
    INTERRUPT_PRIORITY_2 = 0x0844u,
    INTERRUPT_CONTROL_2 = 0x08c2u,
    TIMER1_COUNTER = 0x0100u,
    TIMER1_PERIOD = 0x0102u,
    TIMER1_CONTROL = 0x0104u,
    UART1_MODE = 0x0220u
};

static void capture_trace(void* context, uint32_t address, uint32_t opcode) {
    TraceCapture* capture = context;
    capture->address = address;
    capture->opcode = opcode;
    capture->count++;
}

static void test_lifecycle(TestState* state) {
    Dspic33* source = dspic33_create();
    Dspic33* destination = dspic33_create();
    expect(state, source != NULL, "source != NULL");
    expect(state, destination != NULL, "destination != NULL");
    expect(state, !dspic33_copy(NULL, source), "!dspic33_copy(NULL, source)");
    expect(state, !dspic33_copy(destination, NULL), "!dspic33_copy(destination, NULL)");
    expect(state, dspic33_copy(destination, source), "dspic33_copy(destination, source)");
    dspic33_destroy(destination);
    dspic33_destroy(source);
    dspic33_destroy(NULL);
}

static void test_execution(TestState* state) {
    Dspic33* cpu = dspic33_create();
    expect(state, cpu != NULL, "cpu != NULL");
    expect(state, dspic33_load_program_word(cpu, 0u, 0u), "dspic33_load_program_word(cpu, 0u, 0u)");
    dspic33_reset(cpu, 0u);

    Dspic33Result step = dspic33_step_result(cpu);
    expect(state, step.stop == DSPIC33_RUNNING, "step.stop == DSPIC33_RUNNING");
    expect(state, step.instructions == 1u, "step.instructions == 1u");
    expect(state, step.pc == 2u, "step.pc == 2u");
    expect(state, dspic33_get_instruction_count(cpu) == step.instructions,
           "dspic33_get_instruction_count(cpu) == step.instructions");
    expect(state, dspic33_get_cycle_count(cpu) == step.cycles,
           "dspic33_get_cycle_count(cpu) == step.cycles");
    expect(state, dspic33_get_program_counter(cpu) == step.pc,
           "dspic33_get_program_counter(cpu) == step.pc");
    expect(state, dspic33_get_executed_program_counter(cpu) == 0u,
           "executed program counter identifies the stepped instruction");
    expect(state, dspic33_get_trap_count(cpu) == 0u, "dspic33_get_trap_count(cpu) == 0u");
    expect(state, dspic33_get_interrupt_count(cpu) == 0u, "dspic33_get_interrupt_count(cpu) == 0u");
    expect(state, dspic33_get_last_interrupt(cpu) == UINT16_MAX,
           "dspic33_get_last_interrupt(cpu) == UINT16_MAX");
    expect(state, dspic33_get_interrupt_depth(cpu) == 0u, "dspic33_get_interrupt_depth(cpu) == 0u");

    Dspic33Result run = dspic33_run_with_limits(cpu, (Dspic33RunLimits){1u, 0u});
    expect(state, run.stop == DSPIC33_INSTRUCTION_LIMIT, "run.stop == DSPIC33_INSTRUCTION_LIMIT");
    expect(state, run.instructions == 2u, "run.instructions == 2u");

    dspic33_reset(cpu, 0u);
    Dspic33Result cycle_limited = dspic33_run_with_limits(cpu, (Dspic33RunLimits){0u, 1u});
    expect(state, cycle_limited.stop == DSPIC33_INSTRUCTION_LIMIT,
           "cycle-limited run stops at its limit");
    expect(state, cycle_limited.cycles >= 1u, "cycle-limited run consumes a cycle");
    expect(state, dspic33_get_stop(cpu) == DSPIC33_RUNNING,
           "execution limit does not change the processor stop reason");

    dspic33_reset(cpu, 0u);
    expect(state, dspic33_run_until(cpu, 2u, 2u) == DSPIC33_STOPPED,
           "dspic33_run_until(cpu, 2u, 2u) == DSPIC33_STOPPED");
    dspic33_set_stop_on_trap(cpu, true);
    dspic33_set_stop_on_trap(cpu, false);
    dspic33_set_stop_on_trap(NULL, true);
    dspic33_destroy(cpu);

    expect(state, dspic33_step_result(NULL).stop == DSPIC33_HALTED,
           "dspic33_step_result(NULL).stop == DSPIC33_HALTED");
    expect(state, dspic33_run_with_limits(NULL, (Dspic33RunLimits){0u, 0u}).stop == DSPIC33_HALTED,
           "dspic33_run_with_limits(NULL, limits).stop == DSPIC33_HALTED");
}

static void test_trace(TestState* state) {
    Dspic33* source = dspic33_create();
    Dspic33* destination = dspic33_create();
    TraceCapture source_capture = {0};
    TraceCapture destination_capture = {0};
    expect(state, source != NULL && destination != NULL, "trace processors are created");
    expect(state, dspic33_load_program_word(source, 0u, 0x200123u), "trace opcode is loaded");
    dspic33_set_trace(source, capture_trace, &source_capture);
    dspic33_set_trace(destination, capture_trace, &destination_capture);
    expect(state, dspic33_copy(destination, source), "trace processor is copied");
    dspic33_reset(destination, 0u);
    dspic33_step(destination);
    expect(state, destination_capture.count == 1u, "destination trace is called once");
    expect(state, destination_capture.address == 0u, "destination trace reports the address");
    expect(state, destination_capture.opcode == 0x200123u, "destination trace reports the opcode");
    expect(state, source_capture.count == 0u, "copy preserves the destination trace context");
    dspic33_reset(destination, 0u);
    dspic33_step(destination);
    expect(state, destination_capture.count == 2u, "reset preserves the trace callback");
    dspic33_set_trace(destination, NULL, NULL);
    dspic33_reset(destination, 0u);
    dspic33_step(destination);
    expect(state, destination_capture.count == 2u, "cleared trace is not called");
    dspic33_set_trace(NULL, capture_trace, &destination_capture);
    dspic33_destroy(destination);
    dspic33_destroy(source);
}

static void test_coverage(TestState* state) {
    Dspic33* cpu = dspic33_create();
    Dspic33Coverage* coverage = dspic33_coverage_create(0x200u, 8u);
    expect(state, cpu != NULL && coverage != NULL, "coverage resources are created");
    for (uint32_t address = 0x200u; address <= 0x206u; address += 2u) {
        expect(state,
               dspic33_coverage_define_instruction(coverage, address, address < 0x206u),
               "coverage defines an instruction");
    }
    expect(state, dspic33_load_program_word(cpu, 0x200u, 0x320000u),
           "conditional branch is loaded");
    expect(state, dspic33_load_program_word(cpu, 0x202u, 0xe78011u), "compare-and-skip is loaded");
    expect(state, dspic33_load_program_word(cpu, 0x204u, 0xa70002u), "bit skip is loaded");
    expect(state, dspic33_load_program_word(cpu, 0x206u, 0u), "skip target is loaded");
    dspic33_set_coverage(cpu, coverage);
    dspic33_reset(cpu, 0x200u);
    dspic33_step(cpu);
    dspic33_reset(cpu, 0x200u);
    dspic33_write_word(cpu, 0x0042u, 0x0002u);
    dspic33_step(cpu);
    dspic33_reset(cpu, 0x202u);
    dspic33_set_working_register(cpu, 0u, 1u);
    dspic33_set_working_register(cpu, 1u, 1u);
    dspic33_step(cpu);
    dspic33_reset(cpu, 0x202u);
    dspic33_set_working_register(cpu, 0u, 1u);
    dspic33_set_working_register(cpu, 1u, 2u);
    dspic33_step(cpu);
    dspic33_reset(cpu, 0x204u);
    dspic33_set_working_register(cpu, 2u, 0u);
    dspic33_step(cpu);
    dspic33_reset(cpu, 0x204u);
    dspic33_set_working_register(cpu, 2u, 1u);
    dspic33_step(cpu);
    Dspic33CoverageResult result = dspic33_coverage_result(coverage);
    expect(state, result.instructions == 6u, "coverage records executed instructions");
    expect(state, result.outside_range == 0u, "coverage stays inside its range");
    expect(state, result.unique_instructions == 3u, "coverage counts unique instructions");
    expect(state, result.conditional_branches == 6u, "coverage records conditional branches");
    expect(state, result.branches_taken == 3u, "coverage records taken branches");
    expect(state, result.branches_not_taken == 3u, "coverage records not-taken branches");
    expect(state, result.observed_branch_sites == 3u, "coverage counts observed branch sites");
    expect(state, result.observed_branch_outcomes == 6u,
           "coverage counts observed branch outcomes");
    expect(state, result.branch_sites_with_both_outcomes == 3u,
           "coverage counts branches with both outcomes");
    expect(state, result.covered_instructions == 3u,
           "coverage counts defined instructions reached");
    expect(state, result.total_instructions == 4u, "coverage counts defined instructions");
    expect(state, result.instruction_coverage_percent == 75.0,
           "coverage calculates the instruction percentage");
    expect(state, result.covered_branch_sites == 3u,
           "coverage counts defined branch sites reached");
    expect(state, result.total_branch_sites == 3u, "coverage counts defined branch sites");
    expect(state, result.branch_coverage_percent == 100.0,
           "coverage calculates the branch percentage");
    expect(state, (dspic33_coverage_flags(coverage, 0x200u) & DSPIC33_COVERAGE_EXECUTED) != 0u,
           "coverage exposes the first instruction");
    expect(state, (dspic33_coverage_flags(coverage, 0x202u) & DSPIC33_COVERAGE_EXECUTED) != 0u,
           "coverage exposes the second instruction");
    expect(state,
           dspic33_coverage_flags(coverage, 0x204u) ==
               (DSPIC33_COVERAGE_EXECUTED | DSPIC33_COVERAGE_BRANCH_TAKEN |
                DSPIC33_COVERAGE_BRANCH_NOT_TAKEN),
           "coverage exposes branch outcomes");
    dspic33_coverage_clear(coverage);
    dspic33_reset(cpu, 0x208u);
    dspic33_step(cpu);
    result = dspic33_coverage_result(coverage);
    expect(state, result.instructions == 1u, "coverage clear resets counters");
    expect(state, result.outside_range == 1u, "coverage counts instructions outside its range");
    expect(state, result.unique_instructions == 0u, "outside instructions are not unique slots");
    expect(state, result.covered_instructions == 0u, "coverage clear resets covered instructions");
    expect(state, result.total_instructions == 4u, "coverage clear preserves defined instructions");
    expect(state, dspic33_coverage_flags(coverage, 0x200u) == 0u, "coverage clear resets slots");
    dspic33_set_coverage(cpu, NULL);
    dspic33_coverage_destroy(coverage);
    dspic33_destroy(cpu);
    expect(state, dspic33_coverage_create(1u, 2u) == NULL, "coverage rejects odd addresses");
    expect(state, dspic33_coverage_create(0u, 1u) == NULL, "coverage rejects odd sizes");
    expect(state, dspic33_coverage_create(UINT32_MAX - 1u, 4u) == NULL,
           "coverage rejects overflowing ranges");
    expect(state, !dspic33_coverage_define_instruction(NULL, 0u, false),
           "coverage definition requires coverage");
    dspic33_coverage_clear(NULL);
    dspic33_coverage_destroy(NULL);
}

