tylertms/dspic33e-sim/tests/architecture/dspic33/api_test.c
static void test_execution_boundaries(TestState* state) {
    Dspic33* cpu = dspic33_create();
    expect(state, cpu != NULL, "boundary cpu != NULL");
    if (cpu == NULL) {
        return;
    }

    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, dspic33_step(cpu) == DSPIC33_SLEEPING, "sleeping CPU remains stopped");
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, dspic33_step(cpu) == DSPIC33_IDLING, "idling CPU remains stopped");

    dspic33_reset(cpu, 0u);
    expect(state, dspic33_load_program_word(cpu, 0u, 0x060000u), "load boundary return opcode");
    expect(state, dspic33_run(cpu, 0u) == DSPIC33_RETURNED, "run returns at an empty call stack");
    expect(state, dspic33_get_executed_program_counter(cpu) == 0u,
           "completed return reports its program counter");

    dspic33_reset(cpu, 0u);
    expect(state, dspic33_load_program_word(cpu, 0u, 0x051232u), "load boundary RETLW opcode");
    cpu->w[15] = 0x5000u;
    expect(state, dspic33_begin_call(cpu, 0u, false), "begin RETLW call");
    expect(state,
           dspic33_run(cpu, 0u) == DSPIC33_RETURNED && cpu->w[2] == 0x0123u &&
               cpu->w[15] == 0x5000u && cpu->call_depth == 0u,
           "RETLW terminates an empty call frame without stack underflow");

    dspic33_reset(cpu, 0u);
    Dspic33Result returned = dspic33_run_with_limits(cpu, (Dspic33RunLimits){0u, 0u});
    expect(state, returned.stop == DSPIC33_RETURNED, "limited runner reports a completed return");

    cpu->stop_reason = DSPIC33_TRAPPED;
    cpu->address_error_return = 0x120u;
    expect(state, dspic33_get_fault_address(cpu) == 0x120u,
           "fault getter prefers the address-error return");
    cpu->address_error_return = 0u;
    cpu->current_instruction_pc = 0x220u;
    expect(state, dspic33_get_fault_address(cpu) == 0x220u,
           "fault getter falls back to the current instruction");
    cpu->trap_count = 3u;
    expect(state, dspic33_get_trap_count(cpu) == 3u, "trap getter reports handled traps");
    dspic33_destroy(cpu);
}

static void test_power_save_time_advance(TestState* state) {
    Dspic33* cpu = dspic33_create();
    expect(state, cpu != NULL, "power-save cpu is created");
    if (cpu == NULL) {
        return;
    }

    expect(state, dspic33_load_program_word(cpu, 0u, OPCODE_POWER_SAVE_IDLE),
           "idle instruction is loaded");
    expect(state, dspic33_load_program_word(cpu, TIMER1_VECTOR, 0x000300u),
           "Timer1 vector is loaded");
    expect(state, dspic33_load_program_word(cpu, 0x0300u, OPCODE_NOP), "Timer1 handler is loaded");
    dspic33_reset(cpu, 0u);
    dspic33_set_working_register(cpu, 15u, 0x5000u);
    dspic33_write_word(cpu, TIMER1_COUNTER, 0u);
    dspic33_write_word(cpu, TIMER1_PERIOD, 1u);
    dspic33_write_word(cpu, INTERRUPT_ENABLE_0, 0x0008u);
    dspic33_write_word(cpu, INTERRUPT_PRIORITY_0, 0x1000u);
    dspic33_write_word(cpu, INTERRUPT_CONTROL_2, 0x8000u);
    dspic33_write_word(cpu, TIMER1_CONTROL, 0x8000u);
    expect(state, dspic33_step(cpu) == DSPIC33_IDLING, "PWRSAV enters Idle mode");
    expect(state, dspic33_device_advance(cpu, 1u), "public API advances Idle device time");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->power_state == DSPIC33_POWER_ACTIVE &&
               dspic33_get_last_interrupt(cpu) == 3u,
           "Timer1 wakes the CPU from Idle");

    expect(state, dspic33_load_program_word(cpu, 0u, OPCODE_POWER_SAVE_SLEEP),
           "sleep instruction is loaded");
    expect(state, dspic33_load_program_word(cpu, UART1_RECEIVE_VECTOR, 0x000400u),
           "UART1 receive vector is loaded");
    expect(state, dspic33_load_program_word(cpu, 0x0400u, OPCODE_NOP), "UART1 handler is loaded");
    dspic33_reset(cpu, 0u);
    dspic33_set_working_register(cpu, 15u, 0x5000u);
    dspic33_write_word(cpu, UART1_MODE, 0x8080u);
    dspic33_write_word(cpu, INTERRUPT_ENABLE_0, 0x0800u);
    dspic33_write_word(cpu, INTERRUPT_PRIORITY_2, 0x1000u);
    dspic33_write_word(cpu, INTERRUPT_CONTROL_2, 0x8000u);
    expect(state, dspic33_step(cpu) == DSPIC33_SLEEPING, "PWRSAV enters Sleep mode");
    expect(state, dspic33_uart_receive(cpu, 0u, 0x33u, 0u), "UART wake input is queued");
    expect(state, dspic33_device_advance(cpu, 0u), "public API processes due wake input");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->power_state == DSPIC33_POWER_ACTIVE &&
               dspic33_get_last_interrupt(cpu) == 11u,
           "UART1 wakes the CPU from Sleep");

    dspic33_destroy(cpu);
}

static void test_host_operations(TestState* state) {
    Dspic33* cpu = dspic33_create();
    expect(state, cpu != NULL, "cpu != NULL");
    const uint8_t bytes[] = {0x34u, 0x12u};
    expect(state, dspic33_seed_data(cpu, 0x100u, bytes, sizeof(bytes)),
           "dspic33_seed_data(cpu, 0x100u, bytes, sizeof(bytes))");
    expect(state, dspic33_read_word(cpu, 0x100u) == 0x1234u,
           "dspic33_read_word(cpu, 0x100u) == 0x1234u");
    expect(state, dspic33_get_register(cpu, 16u) == 0u, "dspic33_get_register(cpu, 16u) == 0u");
    expect(state, !dspic33_seed_data(cpu, DSPIC33_DATA_SIZE, bytes, sizeof(bytes)),
           "!dspic33_seed_data(cpu, DSPIC33_DATA_SIZE, bytes, sizeof(bytes))");
    expect(state, dspic33_seed_data(cpu, DSPIC33_DATA_SIZE, NULL, 0u),
           "dspic33_seed_data(cpu, DSPIC33_DATA_SIZE, NULL, 0u)");
    expect(state, dspic33_begin_call(cpu, 0u, false), "dspic33_begin_call(cpu, 0u, false)");
    expect(state, !dspic33_begin_call(cpu, 1u, false), "!dspic33_begin_call(cpu, 1u, false)");
    expect(state, !dspic33_begin_call(cpu, DSPIC33_PROGRAM_LIMIT, false),
           "!dspic33_begin_call(cpu, DSPIC33_PROGRAM_LIMIT, false)");
    bool high = false;
    expect(state, dspic33_gpio_drive(cpu, 1u, 1u, 1u), "dspic33_gpio_drive(cpu, 1u, 1u, 1u)");
    expect(state, dspic33_gpio_signal(cpu, 1u, 0u, &high) && high,
           "dspic33_gpio_signal(cpu, 1u, 0u, &high) && high");
    expect(state, !dspic33_gpio_signal(cpu, DSPIC33_GPIO_PORT_COUNT, 0u, &high),
           "!dspic33_gpio_signal(cpu, DSPIC33_GPIO_PORT_COUNT, 0u, &high)");
    dspic33_destroy(cpu);
}

static void test_null_getters(TestState* state) {
    expect(state, dspic33_get_register(NULL, 0u) == 0u, "dspic33_get_register(NULL, 0u) == 0u");
    expect(state, dspic33_get_program_counter(NULL) == 0u,
           "dspic33_get_program_counter(NULL) == 0u");
    expect(state, dspic33_get_executed_program_counter(NULL) == 0u,
           "dspic33_get_executed_program_counter(NULL) == 0u");
    expect(state, dspic33_get_instruction_count(NULL) == 0u,
           "dspic33_get_instruction_count(NULL) == 0u");
    expect(state, dspic33_get_cycle_count(NULL) == 0u, "dspic33_get_cycle_count(NULL) == 0u");
    expect(state, dspic33_get_stop(NULL) == DSPIC33_HALTED,
           "dspic33_get_stop(NULL) == DSPIC33_HALTED");
    expect(state, dspic33_get_fault_address(NULL) == 0u, "dspic33_get_fault_address(NULL) == 0u");
    expect(state, dspic33_get_trap_count(NULL) == 0u, "dspic33_get_trap_count(NULL) == 0u");
    expect(state, dspic33_get_interrupt_count(NULL) == 0u,
           "dspic33_get_interrupt_count(NULL) == 0u");
    expect(state, dspic33_get_last_interrupt(NULL) == UINT16_MAX,
           "dspic33_get_last_interrupt(NULL) == UINT16_MAX");
    expect(state, dspic33_get_interrupt_depth(NULL) == 0u,
           "dspic33_get_interrupt_depth(NULL) == 0u");
}

